西瓜数据集2.0
    dataSet = [
        ['青年', '没工作', '没房子','一般', '否'],
        ['青年', '没工作', '没房子','好', '否'],
        ['青年', '有工作', '没房子','好', '是'],
        ['青年', '有工作', '有房子','一般', '是'],
        ['青年', '没工作', '没房子','一般', '否'],

        ['中年', '没工作', '没房子','一般', '否'],
        ['中年', '没工作', '没房子','好', '否'],
        ['中年', '有工作', '有房子','好', '是'],
        ['中年', '没工作', '有房子','非常好', '是'],
        ['中年', '没工作', '有房子','非常好', '是'],

        ['老年', '没工作', '有房子','非常好', '是'],
        ['老年', '没工作', '有房子','好', '是'],
        ['老年', '有工作', '没房子','好', '是'],
        ['老年', '有工作', '没房子','非常好', '是'],
        ['老年', '没工作', '没房子','一般', '否']
    ]